; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain sailing)
     (:requirements :typing :fluents)
     (:types
          boat person - object
     )
     (:predicates
          (saved ?t - person)
     )
     (:functions
          (x ?b - boat)
          (y ?b - boat)
          (d ?t - person)
     )
     ;; Increment the value in the given counter by one
     (:action go_north_east
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_north_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_est
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 3))
     )
     (:action go_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 3))
     )
     (:action go_south_west
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south_east
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south
          :parameters(?b - boat)
          :precondition (and)
          :effect (and (decrease (y ?b) 2))
     )
     (:action save_person
          :parameters(?b - boat ?t - person)
          :precondition ( and (>= (+ (x ?b) (y ?b)) (d ?t))
               (>= (- (y ?b) (x ?b)) (d ?t))
               (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25))
               (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
          )
          :effect (and(saved ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_15_4)

	(:domain sailing)

	(:objects
		b0 b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 - boat
		p0 p1 p2 p3 - person
	)

  (:init
		(= (x b0) 1)
(= (y b0) 0)
(= (x b1) -7)
(= (y b1) 0)
(= (x b2) 2)
(= (y b2) 0)
(= (x b3) -4)
(= (y b3) 0)
(= (x b4) 0)
(= (y b4) 0)
(= (x b5) 4)
(= (y b5) 0)
(= (x b6) 8)
(= (y b6) 0)
(= (x b7) -3)
(= (y b7) 0)
(= (x b8) 2)
(= (y b8) 0)
(= (x b9) -8)
(= (y b9) 0)
(= (x b10) 5)
(= (y b10) 0)
(= (x b11) 3)
(= (y b11) 0)
(= (x b12) -5)
(= (y b12) 0)
(= (x b13) 4)
(= (y b13) 0)
(= (x b14) 6)
(= (y b14) 0)

		(= (d p0) 24)
(= (d p1) 92)
(= (d p2) 29)
(= (d p3) 49)

	)

	(:goal
		(and
			(saved p0)
(saved p1)
(saved p2)
(saved p3)
		)
	)
)

; plan
1. (go_north_east b4)
   changed: (x b4) from 0 to 1.5, (y b4) from 0 to 1.5
   goals met: 0 of 4
2. (go_north_east b4)
   changed: (x b4) from 1.5 to 3, (y b4) from 1.5 to 3
   goals met: 0 of 4
3. (go_north_east b4)
   changed: (x b4) from 3 to 4.5, (y b4) from 3 to 4.5
   goals met: 0 of 4
4. (go_north_east b4)
   changed: (x b4) from 4.5 to 6, (y b4) from 4.5 to 6
   goals met: 0 of 4
5. (go_north_east b4)
   changed: (x b4) from 6 to 7.5, (y b4) from 6 to 7.5
   goals met: 0 of 4
6. (go_north_east b4)
   changed: (x b4) from 7.5 to 9, (y b4) from 7.5 to 9
   goals met: 0 of 4
7. (go_north_east b4)
   changed: (x b4) from 9 to 10.5, (y b4) from 9 to 10.5
   goals met: 0 of 4
8. (go_north_east b4)
   changed: (x b4) from 10.5 to 12, (y b4) from 10.5 to 12
   goals met: 0 of 4
9. (go_north_west b4)
   changed: (x b4) from 12 to 10.5, (y b4) from 12 to 13.5
   goals met: 0 of 4
10. (go_north_west b4)
   changed: (x b4) from 10.5 to 9, (y b4) from 13.5 to 15
   goals met: 0 of 4
11. (go_north_west b4)
   changed: (x b4) from 9 to 7.5, (y b4) from 15 to 16.5
   goals met: 0 of 4
12. (go_north_west b4)
   changed: (x b4) from 7.5 to 6, (y b4) from 16.5 to 18
   goals met: 0 of 4
13. (go_north_west b4)
   changed: (x b4) from 6 to 4.5, (y b4) from 18 to 19.5
   goals met: 0 of 4
14. (go_north_west b4)
   changed: (x b4) from 4.5 to 3, (y b4) from 19.5 to 21
   goals met: 0 of 4
15. (go_north_west b4)
   changed: (x b4) from 3 to 1.5, (y b4) from 21 to 22.5
   goals met: 0 of 4
16. (go_north_west b4)
   changed: (x b4) from 1.5 to 0, (y b4) from 22.5 to 24
   goals met: 0 of 4
17. (save_person b4 p0)
   added: (saved p0)
   goals met: 1 of 4
18. (go_north_east b4)
   changed: (x b4) from 0 to 1.5, (y b4) from 24 to 25.5
   goals met: 1 of 4
19. (go_north_east b4)
   changed: (x b4) from 1.5 to 3, (y b4) from 25.5 to 27
   goals met: 1 of 4
20. (go_north_east b4)
   changed: (x b4) from 3 to 4.5, (y b4) from 27 to 28.5
   goals met: 1 of 4
21. (go_north_east b4)
   changed: (x b4) from 4.5 to 6, (y b4) from 28.5 to 30
   goals met: 1 of 4
22. (go_north_east b4)
   changed: (x b4) from 6 to 7.5, (y b4) from 30 to 31.5
   goals met: 1 of 4
23. (go_north_east b4)
   changed: (x b4) from 7.5 to 9, (y b4) from 31.5 to 33
   goals met: 1 of 4
24. (go_north_east b4)
   changed: (x b4) from 9 to 10.5, (y b4) from 33 to 34.5
   goals met: 1 of 4
25. (go_north_east b4)
   changed: (x b4) from 10.5 to 12, (y b4) from 34.5 to 36
   goals met: 1 of 4
26. (go_north_east b4)
   changed: (x b4) from 12 to 13.5, (y b4) from 36 to 37.5
   goals met: 1 of 4
27. (go_north_east b4)
   changed: (x b4) from 13.5 to 15, (y b4) from 37.5 to 39
   goals met: 1 of 4
28. (go_north_west b4)
   changed: (x b4) from 15 to 13.5, (y b4) from 39 to 40.5
   goals met: 1 of 4
29. (go_north_west b4)
   changed: (x b4) from 13.5 to 12, (y b4) from 40.5 to 42
   goals met: 1 of 4
30. (save_person b4 p2)
   added: (saved p2)
   goals met: 2 of 4
31. (go_north_east b4)
   changed: (x b4) from 12 to 13.5, (y b4) from 42 to 43.5
   goals met: 2 of 4
32. (go_north_east b4)
   changed: (x b4) from 13.5 to 15, (y b4) from 43.5 to 45
   goals met: 2 of 4
33. (go_north_east b4)
   changed: (x b4) from 15 to 16.5, (y b4) from 45 to 46.5
   goals met: 2 of 4
34. (go_north_east b4)
   changed: (x b4) from 16.5 to 18, (y b4) from 46.5 to 48
   goals met: 2 of 4
35. (go_north_east b4)
   changed: (x b4) from 18 to 19.5, (y b4) from 48 to 49.5
   goals met: 2 of 4
36. (go_north_east b4)
   changed: (x b4) from 19.5 to 21, (y b4) from 49.5 to 51
   goals met: 2 of 4
37. (go_north_west b4)
   changed: (x b4) from 21 to 19.5, (y b4) from 51 to 52.5
   goals met: 2 of 4
38. (go_north_west b4)
   changed: (x b4) from 19.5 to 18, (y b4) from 52.5 to 54
   goals met: 2 of 4
39. (go_north_west b4)
   changed: (x b4) from 18 to 16.5, (y b4) from 54 to 55.5
   goals met: 2 of 4
40. (go_north_west b4)
   changed: (x b4) from 16.5 to 15, (y b4) from 55.5 to 57
   goals met: 2 of 4
41. (go_north_west b4)
   changed: (x b4) from 15 to 13.5, (y b4) from 57 to 58.5
   goals met: 2 of 4
42. (go_north_west b4)
   changed: (x b4) from 13.5 to 12, (y b4) from 58.5 to 60
   goals met: 2 of 4
43. (go_north_west b4)
   changed: (x b4) from 12 to 10.5, (y b4) from 60 to 61.5
   goals met: 2 of 4
44. (save_person b4 p3)
   added: (saved p3)
   goals met: 3 of 4
45. (go_north_east b4)
   changed: (x b4) from 10.5 to 12, (y b4) from 61.5 to 63
   goals met: 3 of 4
46. (go_north_east b4)
   changed: (x b4) from 12 to 13.5, (y b4) from 63 to 64.5
   goals met: 3 of 4
47. (go_north_east b4)
   changed: (x b4) from 13.5 to 15, (y b4) from 64.5 to 66
   goals met: 3 of 4
48. (go_north_east b4)
   changed: (x b4) from 15 to 16.5, (y b4) from 66 to 67.5
   goals met: 3 of 4
49. (go_north_east b4)
   changed: (x b4) from 16.5 to 18, (y b4) from 67.5 to 69
   goals met: 3 of 4
50. (go_north_east b4)
   changed: (x b4) from 18 to 19.5, (y b4) from 69 to 70.5
   goals met: 3 of 4
51. (go_north_east b4)
   changed: (x b4) from 19.5 to 21, (y b4) from 70.5 to 72
   goals met: 3 of 4
52. (go_north_west b4)
   changed: (x b4) from 21 to 19.5, (y b4) from 72 to 73.5
   goals met: 3 of 4
53. (go_north_west b4)
   changed: (x b4) from 19.5 to 18, (y b4) from 73.5 to 75
   goals met: 3 of 4
54. (go_north_west b4)
   changed: (x b4) from 18 to 16.5, (y b4) from 75 to 76.5
   goals met: 3 of 4
55. (go_north_west b4)
   changed: (x b4) from 16.5 to 15, (y b4) from 76.5 to 78
   goals met: 3 of 4
56. (go_north_west b4)
   changed: (x b4) from 15 to 13.5, (y b4) from 78 to 79.5
   goals met: 3 of 4
57. (go_north_west b4)
   changed: (x b4) from 13.5 to 12, (y b4) from 79.5 to 81
   goals met: 3 of 4
58. (go_north_west b4)
   changed: (x b4) from 12 to 10.5, (y b4) from 81 to 82.5
   goals met: 3 of 4
59. (go_north_west b4)
   changed: (x b4) from 10.5 to 9, (y b4) from 82.5 to 84
   goals met: 3 of 4
60. (go_north_west b4)
   changed: (x b4) from 9 to 7.5, (y b4) from 84 to 85.5
   goals met: 3 of 4
61. (go_north_west b4)
   changed: (x b4) from 7.5 to 6, (y b4) from 85.5 to 87
   goals met: 3 of 4
62. (go_north_west b4)
   changed: (x b4) from 6 to 4.5, (y b4) from 87 to 88.5
   goals met: 3 of 4
63. (go_north_west b4)
   changed: (x b4) from 4.5 to 3, (y b4) from 88.5 to 90
   goals met: 3 of 4
64. (go_north_west b4)
   changed: (x b4) from 3 to 1.5, (y b4) from 90 to 91.5
   goals met: 3 of 4
65. (go_north_west b4)
   changed: (x b4) from 1.5 to 0, (y b4) from 91.5 to 93
   goals met: 3 of 4
66. (save_person b4 p1)
   added: (saved p1)
   goals met: 4 of 4
